import 'package:flutter/material.dart';

class DoaScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Doa-doa Ratib Al-Attas'),
      ),
      body: Padding(
        padding: EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Text(
            'بِسْمِ اللهِ الرَّ حْمَنِ الرَّ حِيْمِ. اَلْحَمْدُ لِلَّهِ رَبِّ الْعَا لَمِيْنَ\n\n'
            'حَمْدًا يُوَافِى نِعَمَهُ وَيُكَافِىءُ مَزِيْدَهُ, يَا رَبَّنَا لَكَ الْحَمْدُ\n\n'
            'كَمَا يَنْبَغِىْ لِجَلاَلِ وَجْهِكَ وَعَظِيْمِ سُلْطَا نِكْ, سُبْحَا نَكَ لاَ\n\n'
            'نُحْصِيْ ثَنَا ءً عَلَيْكَ اَنْتَ كَمَا اَثْنَيْتَ عَلَى نَفْسِكَ, فَلَكَ\n\n'
            'الْحَمْدُ حَتىَّ تَرْضَى, وَلَكَ الْحَمْدُ اِذَارَضِيْتَ, وَلَكَ الْحَمْدُ\n\n'
            'بَعْدَ الرِّضَى. اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِى\n\n'
            'اْلاَوَّلِيْنَ وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنّا مُحَمَّدٍ فِى اْلآ خِرِيْنَ وَصَلِّ\n\n'
            'وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِى كُلِّ وَقْتٍ وَحِيْنٍ, وَصَلِّ وَسَلِّمْ\n\n'
            'عَلَى سَيِّدِنَا مُحَمَّدٍ فِى الْمَلَإِ اْلاَ عْلَى اِلَى يَوْمِ الدِّيْنِ,\n\n'
            'وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ حَتىَّ تَرِثَ اْلاَرْضَ وَمَنْ عَلَيْهَا\n\n'
            'وَاَنْتَ خَيْرُ الْوَارِثِيْنَ. اَللَّهُمَّ اِنَّا نَسْتَحْفِظُكَ وَنَسْتَوْ دِعُكَ\n\n'
            'اَدْيَا نَنَا وَاَنْفُسَنَا وَاَمْوَ الَنَا وَاَهْلَنَا وَكُلَّ ثَيْءٍ\n\n'
            'اَعْطَيْتَنَا. اَللَّهُمَّ اجْعَلْنَا وَاِيَّا هُمْ فِى كَنَفِكَ وَاَمَانِكَ\n\n'
            'وَعِيَاذِكَ, مِنْ كُلِّ شَيْطَانٍ مَرِيْدٍ وَجَبَّارٍ عَنِيْدٍ وَذِىْ عَيْنٍ وَذِيْ\n\n'
            'بَغْيٍ وَذِيْ حَسَدٍ وَمِنْ شَرِّ كَلِّ ذِيْ شَرٍّ, اِنَّكَ عَلَى كُلِّ شّيْىءٍ\n\n'
            'قَدِيْرُ. اَللَّهُمَّ جَمِّلْنَا بِالْعَا فِيَةِ وَالسَّلاَ مَةِ, وَحَقِقْنَا\n\n'
            'بِااتَقْوَى وَاْلاِسْتِقَامَةِ وَاِعِذْنَا مِنْ مُوْ جِبَا تِ النَّدَا مَةِفِى\n\n'
            'اْلحَالِ وَاْلمَالِ, اِنَّكَ سَمِيْعُ الدُّعَاءِ. وَصَلِّ اللَّهُمَّ بِجَلاَلِكَ\n\n'
            'وَجَمَالِكَ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ اَجْمَعِيْنَ,\n\n'
            'وَارْزُقْنَا كَمَالَ اْلمُتَا بَعَةِ لَهُ ظَا هِرًا وَبَا طِنًا يَا\n\n'
            'اَرْحَمَ الرَّاحِمِيْنَ, بِفَضْلِ سُبْحَانَ رَبِّكَ رَبِّ اْلعِزَّةِ عَمَّا\n\n'
            'يَصِفُوْنَ. وَسَلاَمُ عَلَى اْلمُرْسَلِيْنَ وَلْحَمْدُلِلَّهِ رَبِّ اْلعَالَمِيْنَ',
            style: TextStyle(fontSize: 16.0),
          ),
        ),
      ),
    );
  }
}
